# Finding Coefficient of Variation (CV),Quartiles,Inter quartile range(IQR),Cortail Coefficient of dispersion (QCD) -- Median based mesures of dispersion

In [ ]:
import pandas as pd
import numpy as np

In [45]:
tips = pd.read_csv(r"C:\Users\akash\Documents\seaborn_data\seaborn-data\tips.csv")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

**Coefficient of Variation (CV)**

In [78]:
tip_mean=tips['tip'].mean()
tip_std=tips['tip'].std()

bill_mean=tips['total_bill'].mean()
bill_std=tips['total_bill'].std()

tips_cv=tip_std/tip_mean
bill_cv=bill_std/bill_mean

In [79]:
print(f'Coefficient of variation of tip is {tips_cv}')
print(f'Coefficient of variation of total bill is {bill_cv}')

Coefficient of variation of tip is 0.46147751184598895
Coefficient of variation of total bill is 0.44993620594706724

**Quartiles / Quantiles**

In [80]:
Q1 = np.quantile(tips['tip'],q=0.25)
Q2 = np.quantile(tips['tip'],q=0.50)
Q3 = np.quantile(tips['tip'],q=0.75)
Q4 = np.quantile(tips['tip'],q=1)
print(f"1st Quartile is {Q1}")
print(f"2nd Quartile is {Q2}")
print(f"3rd Quartile is {Q3}")
print(f"4th Quartile is {Q4}")

1st Quartile is 2.0
2nd Quartile is 2.9
3rd Quartile is 3.5625
4th Quartile is 10.0

**IQR (Inter quartile range)**

In [84]:
Q1= tips['tip'].quantile(q=0.25)
Q3= tips['tip'].quantile(q=0.75)

In [36]:
q1= tips['total_bill'].quantile(q=0.25)
q3= tips['total_bill'].quantile(q=0.75)

In [86]:
IQR = Q3-Q1
print(f"IQR OF median tip : {IQR}")
iqr = q3-q1
print(f"IQR OF median total bill : {iqr}")

IQR OF median tip : 1.5625
IQR OF median total bill : 87274.0

**Cortail Coefficient of dispersion (QCD)**

In [40]:
QCD = (Q3 - Q1)/(Q3 + Q1)

In [41]:
print(f'Cortail Coefficient of dispersion is {QCD}')

Cortail Coefficient of dispersion is 0.2808988764044944

In [2]:
titanic = pd.read_csv(r"C:\Users\akash\Documents\seaborn_data\seaborn-data\titanic.csv")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

**Coefficient of Variation (CV)**

In [57]:
fare_mean=titanic['fare'].mean()
fare_std=titanic['fare'].std()

age_mean=titanic['age'].mean()
age_std=titanic['age'].std()

fare_cv=fare_std/fare_mean
age_cv=age_std/age_mean

In [58]:
print(f'Coefficient of variation of fare is {fare_cv}')
print(f'Coefficient of variation of passangers age is {age_cv}')

Coefficient of variation of fare is 1.54307252784085
Coefficient of variation of passangers age is 0.48912218554656756

**Quartiles / Quantiles**

In [13]:
Q1 = np.quantile(titanic['fare'],q=0.25)
Q2 = np.quantile(titanic['fare'],q=0.50)
Q3 = np.quantile(titanic['fare'],q=0.75)
Q4 = np.quantile(titanic['fare'],q=1)
print(f"1st Quartile is {Q1}")
print(f"2nd Quartile is {Q2}")
print(f"3rd Quartile is {Q3}")
print(f"4th Quartile is {Q4}")

1st Quartile is 7.9104
2nd Quartile is 14.4542
3rd Quartile is 31.0
4th Quartile is 512.3292

**IQR (Inter quartile range)**

In [95]:
Q1= titanic['fare'].quantile(q=0.25)
Q3= titanic['fare'].quantile(q=0.75)

In [96]:
q1= titanic['age'].quantile(q=0.25)
q3= titanic['age'].quantile(q=0.75)

In [97]:
IQR = Q3-Q1
print(f"IQR OF median fare : {IQR}")

IQR OF median fare : 23.0896

In [94]:
iqr = q3-q1
print(f"IQR OF median age : {iqr}")

IQR OF median age : 17.875

**Cortail Coefficient of dispersion (QCD)**

In [16]:
QCD = (Q3 - Q1)/(Q3 + Q1)

In [17]:
print(f'Cortail Coefficient of dispersion is {QCD}')

Cortail Coefficient of dispersion is 0.5934043340597887

In [18]:
housing = pd.read_csv(r"C:\Users\akash\Documents\seaborn_data\seaborn-data\Housing.csv")
housing

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
...,...,...,...,...,...,...,...,...,...,...,...,...,...
540,1820000,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished
541,1767150,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished
542,1750000,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished
543,1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
544,1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished

**Coefficient of Variation (CV)**

In [60]:
room_mean=housing['bedrooms'].mean()
room_std=housing['bedrooms'].std()

bath_mean=housing['bathrooms'].mean()
bath_std=housing['bedrooms'].std()

room_cv=room_std/room_mean
bath_cv=bath_std/bath_mean

In [61]:
print(f'Coefficient of variation of fare is {room_cv}')
print(f'Coefficient of variation of passangers age is {bath_cv}')

Coefficient of variation of fare is 0.2489138638674959
Coefficient of variation of passangers age is 0.5738156975889777

**Quartiles / Quantiles**

In [36]:
Q1 = np.quantile(housing['bedrooms'],q=0.25)
Q2 = np.quantile(housing['bedrooms'],q=0.50)
Q3 = np.quantile(housing['bedrooms'],q=0.75)
Q4 = np.quantile(housing['bedrooms'],q=1)
print(f"1st Quartile is {Q1}")
print(f"2nd Quartile is {Q2}")
print(f"3rd Quartile is {Q3}")
print(f"4th Quartile is {Q4}")

1st Quartile is 2.0
2nd Quartile is 3.0
3rd Quartile is 3.0
4th Quartile is 6

**IQR (Inter quartile range)**

In [87]:
Q1= housing['bedrooms'].quantile(q=0.25)
Q3= housing['bedrooms'].quantile(q=0.75)

In [88]:
q1= housing['bathrooms'].quantile(q=0.25)
q3= housing['bathrooms'].quantile(q=0.75)

In [89]:
IQR = Q3-Q1
print(f"IQR OF median bedroom : {IQR}")

IQR OF median bedroom : 1.0

In [90]:
iqr = q3-q1
print(f"IQR OF median bathroom : {iqr}")

IQR OF median bathroom : 1.0

**Cortail Coefficient of dispersion (QCD)**

In [39]:
QCD = (Q3 - Q1)/(Q3 + Q1)

In [40]:
print(f'Cortail Coefficient of dispersion is {QCD}')

Cortail Coefficient of dispersion is 0.2

In [42]:
salary = pd.read_csv(r"C:\Users\akash\Documents\seaborn_data\seaborn-data\ds_salaries.csv.xls")
salary

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

**Coefficient of Variation (CV)**

In [63]:
salary_mean=salary['salary'].mean()
salary_std=salary['salary'].std()

usd_mean=salary['salary_in_usd'].mean()
usd_std=salary['salary_in_usd'].std()

salary_cv=salary_std/salary_mean
usd_cv=usd_std/usd_mean

In [65]:
print(f'Coefficient of variation of salary is {salary_cv}')
print(f'Coefficient of variation of salary in usd is {usd_cv}')

Coefficient of variation of salary is 4.766534531594616
Coefficient of variation of salary in usd is 0.6318664771209166

**Quartiles / Quantiles**

In [67]:
Q1 = np.quantile(salary['salary'],q=0.25)
Q2 = np.quantile(salary['salary'],q=0.50)
Q3 = np.quantile(salary['salary'],q=0.75)
Q4 = np.quantile(salary['salary'],q=1)
print(f"1st Quartile is {Q1}")
print(f"2nd Quartile is {Q2}")
print(f"3rd Quartile is {Q3}")
print(f"4th Quartile is {Q4}")

1st Quartile is 70000.0
2nd Quartile is 115000.0
3rd Quartile is 165000.0
4th Quartile is 30400000

**IQR (Inter quartile range)**

In [69]:
Q1= salary['salary'].quantile(q=0.25)
Q3= salary['salary'].quantile(q=0.75)

In [70]:
q1= salary['salary_in_usd'].quantile(q=0.25)
q3= salary['salary_in_usd'].quantile(q=0.75)

In [71]:
IQR = Q3-Q1
print(f"IQR OF median salary: {IQR}")

IQR OF median salary: 95000.0

In [72]:
iqr = q3-q1
print(f"IQR OF median salary in usd : {iqr}")

IQR OF median salary in usd : 87274.0

**Cortail Coefficient of dispersion (QCD)**

In [74]:
QCD = (Q3 - Q1)/(Q3 + Q1)

In [75]:
print(f'Cortail Coefficient of dispersion of salary is {QCD}')

Cortail Coefficient of dispersion is 0.40425531914893614

In [76]:
qcd = (q3 - q1)/(q3 + q1)

In [77]:
print(f'Cortail Coefficient of dispersion of salary is {qcd}')

Cortail Coefficient of dispersion of salary in usd is 0.41026484773840527